app/views/posts/index.html.haml

SELECT "posts".* FROM "posts"
---
  .col-lg-9.col-md-9.col-xs-9
    -@posts.each do |pp|
      .container.border-top.border-bottom.post_container
        .row.title_container.my-2.border-bottom