app/controllers/pending_posts_controller.rb

SELECT "pending_posts".* FROM "pending_posts"
SELECT COUNT(*) FROM "pending_posts"
---
  def index
    @pending_posts = PendingPost.page(params[:page]).per(4)

INSERT INTO "posts" ("id", "user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "pending_posts" ("user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @pending_post = current_user.pending_posts.build(pending_post_params)
    respond_to do |format|
      @pending_post.tag_list = pending_post_params[:tag_list]
      if @pending_post.save

SELECT  "pending_posts".* FROM "pending_posts" WHERE "pending_posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "pending_posts" WHERE "pending_posts"."id" = ?  [["id", 1]]
INSERT INTO "posts" ("id", "user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def accept
    @pending_post = PendingPost.find(params[:pending_post_id])
    puts "ALL TAG BEFORE #{@pending_post.all_tags_list}"
    @pending_post.id = Post.count + 1
    @post = @pending_post.user.posts.build @pending_post.attributes

    logger.debug "ALL TAG: #{@pending_post.all_tags_list}"
    @pending_post.tag_list.map{ |p| @post.tag_list.add(p) }

    @pending_post.destroy!
    @post.save!

DELETE FROM "pending_posts" WHERE "pending_posts"."id" = ?  [["id", 3]]
---
  def destroy
    @pending_post.destroy

SELECT  "pending_posts".* FROM "pending_posts" WHERE "pending_posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_pending_post
      @pending_post = PendingPost.find(params[:id])