app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("user_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def index

    @users_suggested = current_user.suggested_friends.take(10)
    @users_tags_common = current_user.tag_in_common_friends.take(10)

    if params[:tag]
      @posts = Post.tagged_with(params[:tag]).page(params[:page]).per(4)
---
SELECT "posts".* FROM "posts" WHERE (title LIKE '%Aaa')