app/models/user.rb

  def self.new_with_session(params, session)
    super.tap do |user|
      if data = session["devise.facebook_data"] && session["devise.facebook_data"]["extra"]["raw_info"]
        user.email = data["email"] if user.email.blank?
---
SELECT  1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "danieligno10@gmail.com"], ["LIMIT", 1]]

  def self.from_omniauth(auth)
    where(provider: auth.provider, uid: auth.uid).first_or_create do |user|
---
INSERT INTO "users" ("created_at", "updated_at", "email", "encrypted_password", "username", "provider", "uid", "image") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "facebook"], ["uid", "2190773817870939"], ["LIMIT", 1]]